app/controllers/events_controller.rb

  def create
    @event = Event.new(event_params)
    @event.user_event = @current_user.id
    respond_to do |format|
      if @event.save
---
INSERT INTO "events" ("title", "start", "end", "color", "allDay", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)