app/controllers/home_controller.rb

  def top
    @user = User.find_by(user_id: params[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."user_id" IS NULL LIMIT ?  [["LIMIT", 1]]

  def create
    @user = User.new(email: params[:email], user_id: params[:user_id],
      password: params[:password], password_confirmation: params[:password_confirmation])



      if @user.save
---
INSERT INTO "users" ("user_id", "created_at", "updated_at", "email", "password_digest") VALUES (?, ?, ?, ?, ?)