app/controllers/tasks_controller.rb

  def create
    @task = Task.new(task_params)
    @task.task_user = @current_user.id
    respond_to do |format|
      if @task.save
---
INSERT INTO "tasks" ("task_name", "deadline_date", "deadline_time", "required_time", "priority", "color", "comment", "created_at", "updated_at", "task_user") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @task.update(task_params)
---
UPDATE "tasks" SET "priority" = ?, "color" = ?, "deadline_time" = ?, "required_time" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["priority", 10], ["color", "yellow"], ["deadline_time", "2000-01-01 13:00:00"], ["required_time", "2000-01-01 01:30:00"], ["updated_at", "2018-03-28 02:10:27.471650"], ["id", 1]]