app/controllers/users_controller.rb

  def login
<<<<<<< HEAD
    @user = User.find_by(user_id: params[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."user_id" = ? LIMIT ?  [["user_id", "Adrian"], ["LIMIT", 1]]

  def update
    @user = User.find_by(id: params[:id])
    @user.user_id = params[:user_id]
    @user.email = params[:email]
    @user.password = params[:password]
    @user.password_confirmation = params[:password_confirmation]

    if params[:image]
      @user.user_image = "#{@user.id}.jpg"
      image = params[:image]
      File.binwrite("public/img/#{@user.user_image}", image.read)
    end


    if @user.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "password_digest" = ?, "user_image" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$10$0GRGLjLmMdrc4DDp4BYEzeUgPyADEapeT8MeUQXJ3rAQ95mjqKHFC"], ["user_image", "1.jpg"], ["updated_at", "2018-03-27 11:44:40.655837"], ["id", 1]]